[
    {
        "id": 1,
        "title": "Hello World!",
        "slug": "hello-world",
        "short_url": "JN7rc",
        "content": "**First post!** 🎉<br><br>Wish me luck-I have no idea what I'm doing 😄",
        "image_url": "https://images.unsplash.com/photo-1535378917042-10a22c95931a?q=80&w=2048&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
        "created_at": "2025-06-11T00:00:00.000000+00:00",
        "published": true
    },
    {
        "id": 2,
        "title": "Breaking Down the Latest Tech Trends: What You Need to Know",
        "slug": "breaking-down-the-latest-tech-trends-what-you-need-to-know",
        "short_url": "8V4iZ",
        "content": "**Nullam mollis tempor odio, et tincidunt enim. Phasellus non dui in leo egestas faucibus. Sed ac nulla nisl.**<br><br>Aenean fermentum elementum dolor, facilisis facilisis lacus imperdiet nec. Maecenas at magna faucibus, gravida dolor eget, condimentum nisl. Curabitur ultrices ex quis tortor tempus molestie. Nulla fermentum at orci vel egestas. Vestibulum et facilisis urna, a scelerisque arcu. Etiam in nibh vel eros ultricies pharetra. Proin non arcu ac nunc mollis imperdiet. Interdum et malesuada fames ac ante ipsum primis in faucibus.",
        "image_url": "https://images.unsplash.com/photo-1504890001746-a9a68eda46e2?q=80&w=1987&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
        "created_at": "2025-06-11T00:00:00.000000+00:00",
        "published": true
    },
    {
        "id": 3,
        "title": "The Rise of AI: Opportunities and Challenges Ahead",
        "slug": "the-rise-of-ai-opportunities-and-challenges-ahead",
        "short_url": "C7IFx",
        "content": "**Pellentesque nunc mi, convallis id convallis vel, molestie sit amet massa. Curabitur velit lectus, vehicula id mattis sed, luctus a nisl.**<br><br>Proin mattis dui finibus justo fringilla, ut blandit velit rutrum. Integer ut purus et eros luctus semper non ac sapien. Phasellus varius mauris vitae dolor luctus mollis. Vestibulum ac pretium neque, ut fermentum quam. Aenean et purus augue. Nunc fringilla, metus eget placerat aliquet, orci nibh porttitor justo, ut commodo nisi quam non dolor.<br><br>Cras posuere, lorem vitae commodo dictum, odio quam suscipit ex, id pellentesque velit dui quis orci. Praesent aliquet enim id risus semper tempor. Donec vitae blandit lectus. Aenean pretium, felis eget mattis faucibus, neque lectus pretium tortor, quis convallis lacus risus a lacus. Maecenas eget est nec nisi tincidunt bibendum. Aliquam id mauris tortor.",
        "image_url": "https://images.unsplash.com/photo-1677691824188-3e266886cb27?q=80&w=1935&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
        "created_at": "2025-06-11T00:00:00.000000+00:00",
        "published": true
    },
    {
        "id": 4,
        "title": "Top 10 Tools Every Developer Should Know in 2025",
        "slug": "top-10-tools-every-developer-should-know-in-2025",
        "short_url": "IS9w8",
        "content": "**Donec nec metus a purus sollicitudin vehicula ac nec lectus. Nunc in mattis erat, sed volutpat eros.**<br><br>Nullam faucibus odio sed leo fringilla commodo. Duis id ultricies turpis. Pellentesque at luctus neque, eget sagittis velit. Vivamus dignissim in ipsum ac vestibulum. Donec ac nibh maximus, ornare mauris a, blandit tortor. Maecenas lobortis diam dapibus hendrerit aliquam. Integer quis mauris turpis. Ut iaculis ligula eleifend, gravida arcu sit amet, suscipit libero. Mauris tincidunt orci at lacus luctus malesuada. Proin at interdum nunc. Proin consectetur in enim id iaculis. Mauris hendrerit scelerisque est, vel accumsan ex tristique in. Nunc ac tincidunt orci. In ultrices maximus eros ac consequat.",
        "image_url": "https://images.unsplash.com/photo-1522071820081-009f0129c71c?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
        "created_at": "2025-06-11T00:00:00.000000+00:00",
        "published": true
    },
    {
        "id": 5,
        "title": "From Code to Cloud: Navigating Modern Deployment Strategies",
        "slug": "from-code-to-cloud-navigating-modern-deployment-strategies",
        "short_url": "D7OHc",
        "content": "Vestibulum rhoncus posuere faucibus. Sed imperdiet neque sit amet tincidunt sollicitudin. Pellentesque nisl ante, iaculis non est ut, condimentum sagittis velit. Nulla facilisis ullamcorper bibendum. Nam ut tellus vel tellus tempus sagittis at sed erat. Curabitur in rhoncus nibh. Praesent congue commodo mi eu viverra.",
        "image_url": "https://images.unsplash.com/photo-1573164713988-8665fc963095?q=80&w=2069&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
        "created_at": "2025-06-11T00:00:00.000000+00:00",
        "published": true
    },
    {
        "id": 6,
        "title": "Cybersecurity in the Digital Age: Are You Prepared?",
        "slug": "cybersecurity-in-the-digital-age-are-you-prepared",
        "short_url": "YdP2p",
        "content": "Pellentesque accumsan ut leo a porttitor. Aliquam bibendum quam vitae arcu rhoncus, hendrerit egestas mauris suscipit. Proin venenatis non eros et vestibulum. Nulla eget consectetur orci. Orci varius natoque penatibus et magnis dis parturient montes, nascetur ridiculus mus. Vestibulum vehicula tempus est sed porta. Vestibulum tortor est, tempus sit amet nibh vel, ultrices auctor odio. Curabitur ut fermentum sem. Vestibulum vel urna sollicitudin, dapibus odio iaculis, scelerisque odio. Mauris venenatis congue ex in pretium. Integer ut nibh eu justo luctus euismod. Nam iaculis nisi a dui ullamcorper consectetur. Nulla volutpat tellus ut mi euismod, vitae placerat odio euismod.",
        "image_url": "https://images.unsplash.com/photo-1590494165264-1ebe3602eb80?q=80&w=1974&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
        "created_at": "2025-06-11T00:00:00.000000+00:00",
        "published": true
    },
    {
        "id": 7,
        "title": "Hello!",
        "slug": "hello-7",
        "short_url": "DWG3s",
        "content": "<p><strong>This is a test!</strong></p>",
        "image_url": "https://images.unsplash.com/photo-1504384764586-bb4cdc1707b0?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
        "created_at": "2025-06-11T19:48:02.420959+00:00",
        "published": true
    }
]